app/views/posts/index.html.erb

							<div style="float: right">
								<i class="far fa-comment"><%= post.post_comments.count %></i>
								<% if post.favorites.count == 0 %>
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]