app/views/posts/show.html.erb

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ? ORDER BY "post_comments"."id" DESC  [["post_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]
---
							<div style="float: right; margin-top: 10px">
								<i class="far fa-comment"><%= @post.post_comments.count %>件</i>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]
---
									<i class="fas fa-thumbs-up", style="color:orange;"></i><% end %>
										<%= @post.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]
---
									<i class="fas fa-thumbs-up", style="color:silver;"></i><% end %>
										<%= @post.favorites.count %>