app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC
---
	def index
		@posts = Post.all.order(id: "DESC")

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ? ORDER BY "post_comments"."id" DESC  [["post_id", 1]]
---
	def show
		@post = Post.find(params[:id])
		@user = User.find(@post.user_id)
		@post_comment = PostComment.new
		@post_comments = @post.post_comments.order(id: "DESC")

INSERT INTO "posts" ("title", "body", "post_image_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@post = Post.new(post_params)
		@post.user_id = current_user.id
		if @post.save