app/controllers/users_controller.rb

	def ensure_correct_user
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def show
		@user = User.find(params[:id])
		@posts = @user.posts.order(id: "DESC")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."id" DESC  [["user_id", 1]]

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", "6f63fe0ce611177c2839006b21b011af25b4bb87cc9e94967f290ac89bb1"], ["updated_at", "2020-05-28 02:24:03.727588"], ["id", 1]]